Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: Note that the nanosecond based fields (Stat.st_atim, Stat.st_mtim and Stat.st_ctim) can be accessed without checking this flag, because this module defines fallback procs when they are not available.
ja: このモジュールはナノ秒時間分解能が利用不能であるときにフォールバック用のプロシージャを定義するため、このフラグを確認せずにナノ秒関連のフィールド (Stat.st_atim, Stat.st_mtim および Stat.st_ctim) へアクセスできることに注意してください。

source: Note that the value returned may be larger than item!
ja: 返された値はアイテムよりも大きい場合があることに注意してください。

source: Note that this only effects code generation on C like backends Source Edit
ja: 注意点として C などのバックエンドではコード生成に限り影響があります。 ソース 編集

source: Note that unhandled exceptions in a thread nevertheless cause the whole process to die.
ja: スレッドの未処理例外はプロセス全体の異常停止の原因となることに注意してください。

source: Note that when passing objects to procedures on another thread by pointer (for example through a thread's argument), objects created using the default allocator will use thread-local, GC-managed memory.
ja: ポインタにより別スレッドにあるプロシージャへオブジェクトを渡すときは (例えばスレッドの引数を通じて)、デフォルトのアロケータで作成されたオブジェクトはスレッド・ローカルのガベージコレクタにより管理されたメモリを使うことに注意してください。

source: Note that you can't pass any args if you use the option poEvalCommand, which invokes the system shell to run the specified command.
ja: poEvalCommand オプションを使うときに args に渡せない場合は、指定された command を実行するためにシステムのシェルを呼び出すことに注意してください。

source: Note, single letter options that take an argument require a colon.
ja: 注意として、単文字オプションの引数はコロンで指定してください。

source: Note: This is not ready for other people to use!
ja: 注意: これは他の人たちが使うための用意ができていません！

source: Note: experimental module and relies on {.experimental: "dotOperators".}
ja: 備考: 実験的なモジュールであり {.experimental: "dotOperators".} に依存します。

source: Notes
ja: 備考

source: Notify about events specified by MASK.
ja: mask により通知イベントが指定されます。

source: Now ProcessOption uses the correct spelling ("daemon"), and this is needed just for backward compatibility.
ja: 現在、 ProcessOption は正しいスペル ("daemon") を使うため、これは後方互換性のためだけに必要とされるものです。

source: Numbers
ja: 数値

source: Numerical constants
ja: 数値定数

source: OS-Path normalization.
ja: オペレーティングシステムにおけるパスの正規化です。

source: Object Oriented Programming
ja: オブジェクト指向プログラミング

source: Objects
ja: オブジェクト

source: Often, you might work with callback-based API-s.
ja: 大抵は、コールバックベースの API を呼び出します。

source: On POSIX this uses the dlsym mechanism, on Windows LoadLibrary.
ja: このモジュールは POSIX では dlsym 機構を、 Windows では LoadLibrary 関数を使います。

source: On Posix OSes the procedure sends SIGKILL to the process.
ja: POSIX オペレーティング・システムのプロシージャでは SIGKILL をプロセスへ送信します。

source: On Posix OSes the procedure sends SIGTERM to the process.
ja: POSIX オペレーティング・システムのプロシージャでは SIGTERM をプロセスへ送信します。

source: On UNIX the linenoise library is wrapped and set up to provide default key bindings (e.g. you can navigate with the arrow keys).
ja: UNIX では linenoise ライブラリのラッパーであり、デフォルトのキーバインディングが使えるよう設定済みです (例えば、矢印キーでの操作)。

source: On UNIX, the implementation simply uses ANSI escape sequences and does not depend on any other module, on Windows it uses the Windows API.
ja: UNIX では、ほかのモジュールへ依存しない ANSI エスケープシーケンスによる実装であり、 Windows では Windows API を使います。

source: On UNIX, this uses the iconv library, on Windows the Windows API.
ja: このモジュールは UNIX では iconv ライブラリを、Windows では Windows API を使います。

source: On Unix, always "UTF-8" is returned.
ja: Unix では、必ず "UTF-8" が返されます。

source: On Windows system.readLine is used.
ja: Windows では system.readLine が使われます。

source: On Windows kill is simply an alias for terminate().
ja: Windows において kill は terminate() のエイリアスです。

source: On Windows adds ".dll" to filename, on Posix produces "lib$filename.so".
ja: Windows では filename に ".dll" を追加しますが、 POSIX では "lib$filename.so" を生成します。

source: On Windows adds ".exe" to filename, else returns filename unmodified.
ja: Windows では filename に ".exe" を追加しますが、それ以外のプラットフォームでは無変更の filename を返します。

source: On Windows the Win32 API function TerminateProcess() is called to stop the process.
ja: Windows においてプロセス停止時に Win32 API 関数である TerminateProcess() が呼び出されます。

source: On many operating systems, the first command line argument is the name of the executable.
ja: ほとんどのオペレーティング・システムにおいて、第一コマンドライン引数は実行可能ファイル名です。

source: On posix, if the process has exited because of a signal, 128 + signal number will be returned.
ja: POSIX において、シグナルが原因でプロセスが終了したときは、 128 + シグナル番号を返します。

source: On posix, this is an alias to posix.Time.
ja: POSIX システムにおいて、この型は posix.Time のエイリアスです。

source: One can check with hasKey whether the key exists.
ja: key の有無は hasKey で確認できます。

source: Only at line endings checks are necessary if the buffer needs refilling.
ja: 行末であってもバッファの再調整が必要であれば、必ず確認をしてください。

source: Only send event once.
ja: 一度だけイベントを送信します。

source: Only watch the path if it is a directory.
ja: ディレクトリならばパスだけを監視します。

source: Open arrays
ja: 無蓋配列

source: Open database connection
ja: データベースの接続開始

source: Open input stream
ja: 入力ストリームを開く

source: OpenGL Sandbox
ja: OpenGL サンドボックス

source: OpenSSL can also be statically linked using --dynlibOverride:ssl for OpenSSL >= 1.1.0.
ja: OpenSSL は --dynlibOverride:ssl で OpenSSL 1.1.0 以降の静的リンクができます。

source: OpenSSL support
ja: OpenSSL のサポート

source: Opening a connection to a database
ja: データベースの接続開始

source: Opens url with the user's default browser.
ja: ユーザのデフォルトブラウザで url を開きます。

source: Opens a channel c for inter thread communication.
ja: スレッド間通信用のチャンネル c を開きます。

source: Opens a database connection.
ja: データベースの接続を開始します。

source: Opens a file named filename for reading, calls readAll and closes the file afterwards.
ja: 読み取るためにファイル名 filename のファイルを開き、 readAll を呼び出してからファイルを閉じます。

source: Opens a file named filename for writing.
ja: ファイル名 filename を開いて書き込みます。

source: Opens a file named filename with given mode.
ja: mode を指定してファイル名 filename のファイルを開きます。

source: Opens a file specified by the path in filename using the specified FileMode mode asynchronously.
ja: ファイルモード (FileMode) mode で指定されたパスにある filename のファイルを非同期で開きます。

source: Opens the user's default browser without any url (blank page).
ja: url を指定せず (空ページ) にユーザのデフォルトブラウザを開きます。

source: Operators
ja: 演算子

source: Optionally: manpages, documentation, shell completion
ja: オプション: man ページ、ドキュメンテーション、シェル補完

source: Options that can be passed to startProcess proc.
ja: startProcess プロシージャへ渡すオプション。

source: Options:
ja: オプション:

source: Order of evaluation
ja: 評価順序

source: Order of passes
ja: パスのオーダー

source: Ordinal types
ja: 序数型

source: Other Input Formats
ja: そのほかのドキュメント入力形式

source: Other languages name a type like these blob.
ja: 一般的な言語において、この型の名前は blob などがあります。

source: Other possible options are:
ja: ほかに利用できるオプションは、

source: Other section
ja: Other セクション

source: Other tokens
ja: そのほかのトークン

source: Otherwise generics cannot work.
ja: そうしなければ、ジェネリック型は動作しません。

source: Otherwise returns an empty string.
ja: それ以外は空文字列を返します。

source: Otherwise the environment variable BROWSER is used to determine the default browser to use.
ja: さもなければ、環境変数 BROWSER で指定されたデフォルトブラウザを使います。

source: Otherwise the process' exit code.
ja: それ以外はプロセスの終了コードを返します。

source: Output:
ja: 出力:

source: Outputs:
ja: 出力:

source: Overloaded procedures
ja: プロシージャのオーバーロード

source: Overrides the location of a given file belonging to the passed package.
ja: 渡されたパッケージにある指定ファイルの格納先をオーバーライドします。

source: POSIX-compliant systems on conventional hardware are usually pretty easy to port: Add the platform to platform (if it is not already listed there), check that the OS, System modules work and recompile Nim.
ja: 通常、 POSIX 規格準拠システムが搭載されている旧式のシステムすら移植はかなり簡単です。 platform (リストに未掲載の場合) へ プラットフォームを追加するには、 os, system モジュールの動作確認後に Nim の再コンパイルをしてください。

source: Packaging Nim
ja: Nim のパッケージング

source: Packaging for Linux
ja: Linux 版のパッケージング

source: Packed pragma
ja: Packed プラグマ

source: Pairwise (cascade) summation of x[i0:i0+n-1], with O(log n) error growth (vs O(n) for a simple loop) with negligible performance cost if the base case is large enough.
ja: x[i0:i0+n-1] のペアワイズ (カスケード) 法による総和において、規範事例が十分に大きいならば誤差成長 O(log n) の負荷効率は無視できるほど小さいです (線形ループ O(n) との比較)。

source: Parameter substitution
ja: パラメータの置換

source: Parameter substitution is done via $1, $2, $3, etc. Source Edit
ja: パラメータの置換は $1, $2, $3, などで行われます。 ソース 編集

source: Parameters
ja: パラメータ

source: Parsers
ja: パーサー

source: Parses name to a color value.
ja: カラー名 name を解釈してカラー値へ変換します。

source: Parses Sexp from buffer.
ja: buffer から Sexp を解析します。

source: Parses an IP address Raises ValueError on error Source Edit
ja: Parses an IP address Raises ValueError on error ソース 編集

source: Parses from a buffer s into a SexpNode.
ja: バッファ s から SexpNode へ解析します。

source: Parses the HTML from stream s and returns a XmlNode.
ja: ストリーム s から HTML の構文解析を行い、 XmlNode を返します。

source: Parses the HTML from string html and returns a XmlNode.
ja: 文字列 html から HTML の構文解析を行い、 XmlNode を返します。

source: Parses the XML from stream s and returns a XmlNode.
ja: ストリーム s から HTML の構文解析を行い、 XmlNode を返します。

source: Parses the XML from string str and returns a XmlNode.
ja: 文字列 str から XML の構文解析を行い、 XmlNode を返します。

source: Parsing, Lexing
ja: 構文解析器、字句解析器

source: Part 2
ja: 第２部

source: Part 3
ja: 第３部

source: Partial Output:
ja: 部分出力:

source: Pass the filename and an array of times to set the access and modification times respectively.
ja: ファイル名と時刻を記した配列を渡すとアクセス時刻と変更時刻を設定します。

source: PassC pragma
ja: PassC プラグマ

source: PassL pragma
ja: PassL プラグマ

source: Passing Channels Safely
ja: チャネルの安全な渡しかた

source: Path to Inno Setup.
ja: Inno Setup のパス。

source: Path to the C compiler.
ja: C コンパイラのパス。

source: Performs a deep copy of a.
ja: a のディープコピーを行ないます。

source: Pins a thread to a CPU.
ja: CPU にスレッドをピン留め (割り当て) します。

source: Pop and return the current smallest value, and add the new item.
ja: 現在の最小値を pop (ポップ、復帰) して返してから、新しいアイテムを追加します。

source: Pop and return the smallest item from heap, maintaining the heap invariant.
ja: ヒープの不変量を持続したまま、 heap から最小アイテムを pop (ポップ、復帰) して返します。

source: Porting Nim to a new architecture is pretty easy, since C is the most portable programming language (within certain limits) and Nim generates C code, porting the code generator is not necessary.
ja: Nim を新規アーキテクチャへ移植することはかなり簡単です。 C は高い移植性があるプログラミング言語 (ある程度の範囲内では) であり Nim は C コードを生成するため、コードジェネレータの移植は不要です。

source: Porting to new platforms
ja: 新しいプラットホームへの移植

source: Possible options are:
ja: 利用できるオプションは、

source: Possibly volatile-qualified integer type of an object that can be accessed as an atomic entity, even in the presence of asynchronous interrupts.
ja: 非同期割り込みがあっても、アトミックなエンティティとしてアクセス可能な修飾条件付き整数型オブジェクト。

source: Pragmas
ja: プラグマ

source: Precedence
ja: 優先順位

source: Precedence level
ja: 優先順位

source: Prefix is empty.
ja: prefix は空となります。

source: Prepend prefix to the result Source Edit
ja: 処理後に prefix を先頭に追加します。 ソース 編集

source: Procedural type
ja: プロシージャ型

source: Procedure declaration
ja: プロシージャ宣言

source: Procedures
ja: プロシージャ

source: Procs
ja: プロシージャ

source: Produces an XML tree for:
ja: 生成される XML ツリーは、

source: Produces:
ja: 結果:

source: Profiling support for Nim.
ja: Nim で使えるプロファイリングのサポートです。

source: Program is executed.
ja: プログラムが実行された。

source: Project section
ja: Project セクション

source: Project switch
ja: Project スイッチ

source: Properties
ja: プロパティ

source: Provide spaces around binary operators if that enhances readability.
ja: 可読性を向上したいときは、二項演算子の前後にスペースを書いてください。

source: Provides system information in a Uname struct with sysname, nodename, release, version and machine attributes.
ja: Uname 構造体の sysname, nodename, release, version および machine 属性によりシステム情報を取得します。

source: Public API always returns CoroutineRef instead of CoroutinePtr in order to allow holding a reference to coroutine object while it can be safely deallocated by coroutine scheduler loop.
ja: coroutine スケジューラのループによる割り当て開放処理中でも coroutine オブジェクトを保持して参照可能にするために公開 API では CoroutinePtr ではなく CoroutineRef を必ず返します。

source: Public API checks for for it being nil and gracefully fails if it is nil.
ja: そのため、公開 API では nil の確認を行い nil ならば潔く失敗します。

source: Pure libraries
ja: 純血ライブラリ

source: Pure libraries do not depend on any external *.dll or lib*.so binary while impure libraries do.
ja: 純血ライブラリに依存性はなく、混血ライブラリには外部 *.dll または lib*.so バイナリへの依存性はあります。

source: Purpose
ja: 用途

source: Push item onto heap, maintaining the heap invariant.
ja: ヒープの不変量を持続したまま、ヒープへ item を push (プッシュ、退避) します。

source: Put the SMTP connection in TLS (Transport Layer Security) mode.
ja: TLS (トランスポート層セキュリティ) モードで SMTP 接続を行います。

source: Quick start
ja: クイックスタート

source: RST Quick Reference
ja: RST クイックリファレンス

source: Raise exception in case of failure e.g. process not running.
ja: プロセスが実行されていない場合などでは例外が発生します。

source: Raise statement
ja: Raise ステートメント

source: Raised for invalid memory access errors Source Edit
ja: Raised for invalid memory access errors ソース 編集

source: Raises AssertionError if specified code does not raise the specified exception.
ja: 指定の code で指定された例外が起きないときは AssertionError を発生します。

source: Raises AssertionError with msg if cond is false.
ja: cond が false ならば、 msg と共に AssertionError を発生します。

source: Raises EDb if the connection could not be established.
ja: 接続を確立できないときは EDb が発生します。

source: Raises EInvalidLibrary if the symbol could not be found.
ja: シンボルがみつからないときは EInvalidLibrary 例外を発生させます。

source: Raises IOError if it cannot fulfill the request.
ja: リクエストを満たせないときは IOError が発生します。

source: Raises IOError in case of an error.
ja: エラーが起きたときは IOError を発生します。

source: Raises EOF if file does not contain at least n lines.
ja: ファイル内容が n 行よりも少ないときは EOF が発生します。

source: Raises a DbError exception if the connection could not be established.
ja: 接続を確立できないときは DbError 例外が発生します。

source: Raises a DbError exception when failed to insert row.
ja: 行の挿入に失敗したときは DbError 例外が発生します。

source: Raises a DbError exception.
ja: DbError 例外を発生させます。

source: Raises an IOError if the file could not be opened.
ja: ファイルが開けないときは IOError が発生します。

source: Raises an [DbError] exception with ODBC error information Source Edit
ja: ODBC エラー情報として [DbError] の例外を発生させます ソース 編集

source: Raises an IO exception in case of an error.
ja: エラー時は IO 例外が発生します。

source: Raw interfaces are in the other posix*.nim files.
ja: ほかの posix*.nim ファイルにはそのままのインタフェースがあります。

source: Read size bytes from the specified file asynchronously starting at the current position of the file pointer.
ja: ファイルポインタの現在位置を始点として指定されたファイルから size バイトを非同期で読み取ります。

source: Read CGI data from a string.
ja: 文字列から CGI データを読み取ります。

source: Read CGI data.
ja: CGI データを読み取ります。

source: Read a single character from the terminal, blocking until it is entered.
ja: 入力待機を行い、ターミナルから一文字読み取ります。

source: Read or write stream
ja: ストリームの読み書き

source: Read this document for a quick overview of the API design.
ja: このドキュメントには API デザインに関する手短な概要があります。

source: Read this if you want to hack the compiler.
ja: これはコンパイラをハックしたいときにお読みください。

source: Reads a line from stdin.
ja: stdin から line を読み取ります。

source: Reads a password from stdin without printing it.
ja: 標準入力から password (パスワード) を非表示で読み取ります。

source: Reads a line of data from stdin - blocks until n or EOF which happens when stdin is closed Source Edit
ja: stdin からデータを一行読み取ります － stdin が閉じられたときは EOF が出現するまでブロックします ソース 編集

source: Reads a single character from the stream f.
ja: ストリーム f から一文字を読み取ります。

source: Reads a single line from the specified file asynchronously.
ja: 指定されたファイルから一行を非同期で読み取ります。

source: Reads all data from stdin - blocks until EOF which happens when stdin is closed Source Edit
ja: stdin からデータをすべて読み取ります － stdin が閉じられたときは EOF が出現するまでブロックします ソース 編集

source: Reads all data from the specified file.
ja: 指定されたファイルにあるデータをすべて読み取ります。

source: Reads all data from the stream file.
ja: ストリーム file からのすべてのデータを読み取ります。

source: Reads and decodes CGI data and yields the (name, value) pairs the data consists of.
ja: CGI データの読み取りとデコードを行い (name, value) のペアから成るデータを生成します。

source: Reads data and transforms it to a type T (deserialization, unmarshalling).
ja: データを読み取って T 型へ変換します (デシリアライゼーション、アンマーシャリング)。

source: Reads data from the specified future stream until it is completed.
ja: 読み終えるまで指定された Future ストリームからデータを読み取ります。

source: Real world example
ja: 実例

source: Receives a message from the channel c.
ja: チャンネル c からメッセージを受信します。

source: Recursively clear all children of an XmlNode.
ja: XmlNode にある子孫を再帰的に消去します。

source: Reference and pointer types
ja: 参照とポインタ型

source: Registers 'foreignPackageName' to the internal list of foreign deps.
ja: 外部パッケージの依存性で使う内部リストに 'foreignPackageName' を登録します。

source: Registers a thread local handler that is called at the thread's destruction.
ja: スレッドの破棄時に呼び出されるスレッド・ローカルのハンドラを登録します。

source: Registers a foreign command to the intern list of commands that can be queried later.
ja: 後ほど照会可能なコマンドのインターンリストへ外部コマンドを登録します。

source: Registers callback cb to be called when ev will be signaled Source Edit
ja: Registers callback cb to be called when ev will be signaled ソース 編集

source: Regular expressions
ja: 正規表現

source: Regular file.
ja: 通常ファイル。

source: Related Options
ja: 関連オプション

source: Releases the given lock.
ja: 指定されたロックを開放します。

source: Reloading API
ja: API のリロード

source: Remove all elements from heap, making it empty.
ja: heap から要素をすべて削除して、空にします。

source: Remove the watch specified by WD from the inotify instance FD.
ja: inotify インスタンス fd から wd で指定された監視先を除外します。

source: Removes './' from the path (but "foo/.." becomes ".")
ja: パスから './' を除去します (が "foo/.." は "." になります)

source: Removes the file.
ja: ファイル file を削除します。

source: Removes the directory dir.
ja: ディレクトリ dir を削除します。

source: Removes the element at index from heap, maintaining the heap invariant.
ja: ヒープの不変量を持続したまま、 heap から index で指定された要素を削除します。

source: Rename a file or directory on the remote FTP Server from current name name_from to new name name_to Source Edit
ja: リモート FTP サーバーのファイル、またはディレクトリにおける現在の名前 name_from を新しい名前 name_to へリネームします。 ソース 編集

source: Renderer
ja: レンダラ

source: Represents an operating system process.
ja: オペレーティング・システムのプロセスを表します。

source: Required to build this module.
ja: このモジュールのビルドに必要です。

source: Reserved by system Source Edit
ja: Reserved by system ソース 編集

source: Resets all attributes on stdout.
ja: 標準出力の属性をすべてリセットします。

source: Resets all attributes.
ja: 属性をすべてリセットします。

source: Resolves '/foo/../bar' to '/bar'.
ja: '/foo/../bar' から '/bar' を変換します。

source: Responds to the request with the specified HttpCode, headers and content.
ja: 指定された HttpCode、ヘッダとコンテンツでリクエストに応答します。

source: Result is a 32 character hex string with lowercase characters Source Edit
ja: 結果は 32 文字の十六進数 (英数小文字) で返されます ソース 編集

source: Result is a 32 character Source Edit
ja: 結果は 32 文字で返されます ソース 編集

source: Result is undefined if index is out of bounds Source Edit
ja: index が範囲外ならば未定義 (undefined) を返します。 ソース 編集

source: Result variable
ja: Result 変数

source: Results in: "Bei Jing"
ja: 結果は "Bei Jing" です。

source: Resumes the process p.
ja: プロセス p を再開します。

source: Retrieve the server name requested in the client hello.
ja: Client Hello でリクエストされたサーバ名を取得します。

source: Retrieves file.
ja: file を取得します。

source: Retrieves a configuration 'key' like 'gcc.options.always'.
ja: 'gcc.options.always' などの構成 'key' を取得します。

source: Retrieves a single row.
ja: 一行取得します。

source: Retrieves the i'th command line parameter.
ja: i 番目にあるコマンドライン引数を取得します。

source: Retrieves the absolute directory of the current project Source Edit
ja: 現在のプロジェクトにおける絶対ディレクトリを取得します ソース 編集

source: Retrieves the absolute path of the current project Source Edit
ja: 現在のプロジェクトにおける絶対パスを取得します ソース 編集

source: Retrieves the cons value of a SList SexpNode.
ja: SList SexpNode の cons 値を取得します。

source: Retrieves the current position of the file pointer that is used to read from the specified file.
ja: 指定されたファイルの読み取りで使われるファイルポインタの現在位置を取得します。

source: Retrieves the current working directory.
ja: 現在の作業ディレクトリを取得します。

source: Retrieves the directory of the current nims script file.
ja: 現在の nims スクリプトファイルがあるディレクトリを取得します。

source: Retrieves the environment variable of name key.
ja: key で指名された環境変数を取得します。

source: Retrieves the float value of a SFloat SexpNode.
ja: SFloat SexpNode の浮動小数値を取得します。

source: Retrieves the int value of a SInt SexpNode.
ja: SInt SexpNode の整数値を取得します。

source: Retrieves the int value of a SList SexpNode.
ja: SList SexpNode の整数値を取得します。

source: Retrieves the location of 'nimcache'.
ja: 'nimcache' の格納先を取得します。

source: Retrieves the name of the current project Source Edit
ja: 現在のプロジェクト名を取得します ソース 編集

source: Retrieves the number of command line parameters.
ja: コマンドライン引数の個数を取得します。

source: Retrieves the specified file's size.
ja: 指定されたファイルのサイズを取得します。

source: Retrieves the string value of a SString SexpNode.
ja: SString SexpNode の文字列値を取得します。

source: Return -1 if error.
ja: エラー発生時は -1 を返します。

source: Return -1 if the process is still running.
ja: まだプロセスが実行中であれば -1 を返します。

source: Return i`th element of `T Source Edit
ja: T にある i 番目の要素を返します ソース 編集

source: Return OpenSSL version as unsigned long or 0 if not available Source Edit
ja: OpenSSL のバージョンを unsigned long または利用不可ならば 0 を返します。 ソース 編集

source: Return cstring of given column of the row Source Edit
ja: 指定された行にある列の cstring を返します ソース 編集

source: Return current process ID.
ja: 現在のプロセス ID を返します。

source: Return non zero if error.
ja: エラー発生時は非ゼロを返します。

source: Return number of elements of T Source Edit
ja: T の要素数を返します ソース 編集

source: Return number of elements of t Source Edit
ja: t の要素数を返します ソース 編集

source: Return statement
ja: Return ステートメント

source: Return the distance from (0,0) to z.
ja: (0,0) から z までの距離を返します。

source: Return the number of elements of deq.
ja: deq の要素数を返します。

source: Return the number of elements of heap.
ja: heap の要素数を返します。

source: Return the squared distance from (0,0) to z.
ja: (0,0) から z までの平方距離を返します。

source: Return true for named tuples, false for any other type.
ja: 名前付きタプルならば true を、それ以外の型ならば false を返します。

source: Return value: The newly created process object.
ja: 返値: 新しく作成されたプロセスのオブジェクトです。

source: Returned handle is valid only within iterator body.
ja: 返されたハンドルはイテレータ本体でのみ有効です。

source: Returned handle is valid only within the iterator body.
ja: 返されたハンドルはイテレータ本体でのみ有効です。

source: Returns "" if the dataset contains no rows or the database value is NULL.
ja: データセットに行が無いか、データベースの値が NULL ならば "" を返します。

source: Returns "" if the exe cannot be found.
ja: 実行可能ファイルが見つからないときは "" を返します。

source: Returns "" on failure.
ja: 失敗時は "" を返します。

source: Returns -1 if it does not match, else the length of the match Source Edit
ja: Returns -1 if it does not match, else the length of the match ソース 編集

source: Returns -1 if the channel has been closed.
ja: チャンネルが閉じられているときは -1 を返します。

source: Returns 0 if it cannot be detected.
ja: 検出不能時は 0 を返します。

source: Returns 1 if SNI was set, 0 if current SSL configuration doesn't support SNI.
ja: SNI が設定されたときは 1 を、現在の SSL 構成で SNI をサポートしてないときは 0 を返します。

source: Returns a with intensity f.
ja: f の明度を a で返します。

source: Returns default if n is not a SFloat.
ja: n が SFloat でなければ、 default を返します。

source: Returns default if n is not a SInt.
ja: n が SInt でなければ、 default を返します。

source: Returns default if n is not a SList.
ja: n が SList でなければ、 default を返します。

source: Returns default if n is not a SString.
ja: n が SString でなければ、 default を返します。

source: Returns false if the message was not sent because number of pending items in the channel exceeded maxItems.
ja: チャンネルで保留中のアイテム件数が maxItems を超過してしまい、メッセージの送信ができないときは false を返します。

source: Returns n's kind.
ja: n の種類を返します。

source: Returns nil if attributes have not been initialised for this node.
ja: このノードで属性が初期化されていないときは nil を返します。

source: Returns p's error file handle for reading from.
ja: 読み取りで使う p のエラーファイルハンドラを返します。

source: Returns p's error stream for reading from.
ja: 読み取りで使う p のエラーストリームを返します。

source: Returns p's input file handle for writing to.
ja: 書き込みで使う p の入力ファイルハンドラを返します。

source: Returns p's input stream for writing to.
ja: 書き込みで使う p の入力ストリームを返します。

source: Returns p's output file handle for reading from.
ja: 読み取りで使う p の出力ファイルハンドラを返します。

source: Returns p's output stream for reading from.
ja: 読み取りで使う p の出力ストリームを返します。
